zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 8F4, Error Information Register 1 */
#define MTU_MC8_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F4u)

/** \brief 8F6, Error Information Register 2 */
#define MTU_MC8_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F6u)

/** \brief 8F8, Error Information Register 3 */
#define MTU_MC8_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F8u)

/** \brief 8FA, Error Information Register 4 */
#define MTU_MC8_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618FAu)

/** \brief 900, Configuration Registers */
#define MTU_MC9_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061900u)

/** \brief 902, Configuration Register 1 */
#define MTU_MC9_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061902u)

/** \brief 904, MBIST Control Register */
#define MTU_MC9_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061904u)

/** \brief 906, Status Register */
#define MTU_MC9_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061906u)

/** \brief 908, Range Register, single address mode */
#define MTU_MC9_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061908u)

/** \brief 90C, Revision ID Register */
#define MTU_MC9_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006190Cu)

/** \brief 90E, ECC Safety Register */
#define MTU_MC9_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006190Eu)

/** \brief 910, Memory ECC Detection Register */
#define MTU_MC9_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061910u)

/** \brief 912, Error Tracking Register 0 */
#define MTU_MC9_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061912u)

/** \brief 914, Error Tracking Register 1 */
#define MTU_MC9_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061914u)

/** \brief 916, Error Tracking Register 2 */
#define MTU_MC9_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061916u)

/** \brief 918, Error Tracking Register 3 */
#define MTU_MC9_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061918u)

/** \brief 91A, Error Tracking Register 4 */
#define MTU_MC9_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006191Au)

/** \brief 960, Read Data and Bit Flip Register 0 */
#define MTU_MC9_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061960u)

/** \brief 962, Read Data and Bit Flip Register 1 */
#define MTU_MC9_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061962u)

/** \brief 964, Read Data and Bit Flip Register 2 */
#define MTU_MC9_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061964u)

/** \brief 966, Read Data and Bit Flip Register 3 */
#define MTU_MC9_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061966u)

/** \brief 968, Read Data and Bit Flip Register 4 */
#define MTU_MC9_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061968u)

/** \brief 96A, Read Data and Bit Flip Register 5 */
#define MTU_MC9_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Au)

/** \brief 96C, Read Data and Bit Flip Register 6 */
#define MTU_MC9_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Cu)

/** \brief 96E, Read Data and Bit Flip Register 7 */
#define MTU_MC9_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006196Eu)

/** \brief 970, Read Data and Bit Flip Register 8 */
#define MTU_MC9_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061970u)

/** \brief 972, Read Data and Bit Flip Register 9 */
#define MTU_MC9_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061972u)

/** \brief 974, Read Data and Bit Flip Register 10 */
#define MTU_MC9_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061974u)

/** \brief 976, Read Data and Bit Flip Register 11 */
#define MTU_MC9_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061976u)

/** \brief 978, Read Data and Bit Flip Register 12 */
#define MTU_MC9_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061978u)

/** \brief 97A, Read Data and Bit Flip Register 13 */
#define MTU_MC9_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Au)

/** \brief 97C, Read Data and Bit Flip Register 14 */
#define MTU_MC9_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Cu)

/** \brief 97E, Read Data and Bit Flip Register 15 */
#define MTU_MC9_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006197Eu)

/** \brief 980, Read Data and Bit Flip Register 16 */
#define MTU_MC9_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061980u)

/** \brief 982, Read Data and Bit Flip Register 17 */
#define MTU_MC9_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061982u)

/** \brief 984, Read Data and Bit Flip Register 18 */
#define MTU_MC9_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061984u)

/** \brief 986, Read Data and Bit Flip Register 19 */
#define MTU_MC9_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061986u)

/** \brief 988, Read Data and Bit Flip Register 20 */
#define MTU_MC9_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061988u)

/** \brief 98A, Read Data and Bit Flip Register 21 */
#define MTU_MC9_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Au)

/** \brief 98C, Read Data and Bit Flip Register 22 */
#define MTU_MC9_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Cu)

/** \brief 98E, Read Data and Bit Flip Register 23 */
#define MTU_MC9_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006198Eu)

/** \brief 990, Read Data and Bit Flip Register 24 */
#define MTU_MC9_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061990u)

/** \brief 992, Read Data and Bit Flip Register 25 */
#define MTU_MC9_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061992u)

/** \brief 994, Read Data and Bit Flip Register 26 */
#define MTU_MC9_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061994u)

