zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief CF0, SSH Safety Faults Status Register  */
#define MTU_MC12_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061CF0u)

/** \brief CF2, Error Information Register 0 */
#define MTU_MC12_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF2u)

/** \brief CF4, Error Information Register 1 */
#define MTU_MC12_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF4u)

/** \brief CF6, Error Information Register 2 */
#define MTU_MC12_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF6u)

/** \brief CF8, Error Information Register 3 */
#define MTU_MC12_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CF8u)

/** \brief CFA, Error Information Register 4 */
#define MTU_MC12_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061CFAu)

/** \brief D00, Configuration Registers */
#define MTU_MC13_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061D00u)

/** \brief D02, Configuration Register 1 */
#define MTU_MC13_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061D02u)

/** \brief D04, MBIST Control Register */
#define MTU_MC13_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061D04u)

/** \brief D06, Status Register */
#define MTU_MC13_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061D06u)

/** \brief D08, Range Register, single address mode */
#define MTU_MC13_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061D08u)

/** \brief D0C, Revision ID Register */
#define MTU_MC13_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061D0Cu)

/** \brief D0E, ECC Safety Register */
#define MTU_MC13_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061D0Eu)

/** \brief D10, Memory ECC Detection Register */
#define MTU_MC13_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061D10u)

/** \brief D12, Error Tracking Register 0 */
#define MTU_MC13_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D12u)

/** \brief D14, Error Tracking Register 1 */
#define MTU_MC13_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D14u)

/** \brief D16, Error Tracking Register 2 */
#define MTU_MC13_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D16u)

/** \brief D18, Error Tracking Register 3 */
#define MTU_MC13_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D18u)

/** \brief D1A, Error Tracking Register 4 */
#define MTU_MC13_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061D1Au)

/** \brief D60, Read Data and Bit Flip Register 0 */
#define MTU_MC13_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D60u)

/** \brief D62, Read Data and Bit Flip Register 1 */
#define MTU_MC13_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D62u)

/** \brief D64, Read Data and Bit Flip Register 2 */
#define MTU_MC13_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D64u)

/** \brief D66, Read Data and Bit Flip Register 3 */
#define MTU_MC13_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D66u)

/** \brief D68, Read Data and Bit Flip Register 4 */
#define MTU_MC13_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D68u)

/** \brief D6A, Read Data and Bit Flip Register 5 */
#define MTU_MC13_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Au)

/** \brief D6C, Read Data and Bit Flip Register 6 */
#define MTU_MC13_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Cu)

/** \brief D6E, Read Data and Bit Flip Register 7 */
#define MTU_MC13_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D6Eu)

/** \brief D70, Read Data and Bit Flip Register 8 */
#define MTU_MC13_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D70u)

/** \brief D72, Read Data and Bit Flip Register 9 */
#define MTU_MC13_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D72u)

/** \brief D74, Read Data and Bit Flip Register 10 */
#define MTU_MC13_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D74u)

/** \brief D76, Read Data and Bit Flip Register 11 */
#define MTU_MC13_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D76u)

/** \brief D78, Read Data and Bit Flip Register 12 */
#define MTU_MC13_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D78u)

/** \brief D7A, Read Data and Bit Flip Register 13 */
#define MTU_MC13_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Au)

/** \brief D7C, Read Data and Bit Flip Register 14 */
#define MTU_MC13_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Cu)

/** \brief D7E, Read Data and Bit Flip Register 15 */
#define MTU_MC13_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D7Eu)

/** \brief D80, Read Data and Bit Flip Register 16 */
#define MTU_MC13_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D80u)

/** \brief D82, Read Data and Bit Flip Register 17 */
#define MTU_MC13_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D82u)

/** \brief D84, Read Data and Bit Flip Register 18 */
#define MTU_MC13_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D84u)

/** \brief D86, Read Data and Bit Flip Register 19 */
#define MTU_MC13_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D86u)

/** \brief D88, Read Data and Bit Flip Register 20 */
#define MTU_MC13_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D88u)

/** \brief D8A, Read Data and Bit Flip Register 21 */
#define MTU_MC13_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Au)

/** \brief D8C, Read Data and Bit Flip Register 22 */
#define MTU_MC13_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Cu)

/** \brief D8E, Read Data and Bit Flip Register 23 */
#define MTU_MC13_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D8Eu)

/** \brief D90, Read Data and Bit Flip Register 24 */
#define MTU_MC13_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061D90u)

