zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 1396, Read Data and Bit Flip Register 27 */
#define MTU_MC19_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062396u)

/** \brief 1398, Read Data and Bit Flip Register 28 */
#define MTU_MC19_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062398u)

/** \brief 139A, Read Data and Bit Flip Register 29 */
#define MTU_MC19_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Au)

/** \brief 139C, Read Data and Bit Flip Register 30 */
#define MTU_MC19_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Cu)

/** \brief 139E, Read Data and Bit Flip Register 31 */
#define MTU_MC19_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006239Eu)

/** \brief 13A0, Read Data and Bit Flip Register 32 */
#define MTU_MC19_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A0u)

/** \brief 13A2, Read Data and Bit Flip Register 33 */
#define MTU_MC19_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A2u)

/** \brief 13A4, Read Data and Bit Flip Register 34 */
#define MTU_MC19_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A4u)

/** \brief 13A6, Read Data and Bit Flip Register 35 */
#define MTU_MC19_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A6u)

/** \brief 13A8, Read Data and Bit Flip Register 36 */
#define MTU_MC19_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623A8u)

/** \brief 13AA, Read Data and Bit Flip Register 37 */
#define MTU_MC19_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623AAu)

/** \brief 13AC, Read Data and Bit Flip Register 38 */
#define MTU_MC19_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623ACu)

/** \brief 13AE, Read Data and Bit Flip Register 39 */
#define MTU_MC19_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623AEu)

/** \brief 13B0, Read Data and Bit Flip Register 40 */
#define MTU_MC19_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B0u)

/** \brief 13B2, Read Data and Bit Flip Register 41 */
#define MTU_MC19_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B2u)

/** \brief 13B4, Read Data and Bit Flip Register 42 */
#define MTU_MC19_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B4u)

/** \brief 13B6, Read Data and Bit Flip Register 43 */
#define MTU_MC19_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B6u)

/** \brief 13B8, Read Data and Bit Flip Register 44 */
#define MTU_MC19_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623B8u)

/** \brief 13BA, Read Data and Bit Flip Register 45 */
#define MTU_MC19_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BAu)

/** \brief 13BC, Read Data and Bit Flip Register 46 */
#define MTU_MC19_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BCu)

/** \brief 13BE, Read Data and Bit Flip Register 47 */
#define MTU_MC19_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623BEu)

/** \brief 13C0, Read Data and Bit Flip Register 48 */
#define MTU_MC19_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C0u)

/** \brief 13C2, Read Data and Bit Flip Register 49 */
#define MTU_MC19_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C2u)

/** \brief 13C4, Read Data and Bit Flip Register 50 */
#define MTU_MC19_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C4u)

/** \brief 13C6, Read Data and Bit Flip Register 51 */
#define MTU_MC19_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C6u)

/** \brief 13C8, Read Data and Bit Flip Register 52 */
#define MTU_MC19_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623C8u)

/** \brief 13CA, Read Data and Bit Flip Register 53 */
#define MTU_MC19_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CAu)

/** \brief 13CC, Read Data and Bit Flip Register 54 */
#define MTU_MC19_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CCu)

/** \brief 13CE, Read Data and Bit Flip Register 55 */
#define MTU_MC19_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623CEu)

/** \brief 13D0, Read Data and Bit Flip Register 56 */
#define MTU_MC19_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D0u)

/** \brief 13D2, Read Data and Bit Flip Register 57 */
#define MTU_MC19_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D2u)

/** \brief 13D4, Read Data and Bit Flip Register 58 */
#define MTU_MC19_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D4u)

/** \brief 13D6, Read Data and Bit Flip Register 59 */
#define MTU_MC19_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D6u)

/** \brief 13D8, Read Data and Bit Flip Register 60 */
#define MTU_MC19_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623D8u)

/** \brief 13DA, Read Data and Bit Flip Register 61 */
#define MTU_MC19_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DAu)

/** \brief 13DC, Read Data and Bit Flip Register 62 */
#define MTU_MC19_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DCu)

/** \brief 13DE, Read Data and Bit Flip Register 63 */
#define MTU_MC19_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623DEu)

/** \brief 13E0, Read Data and Bit Flip Register 64 */
#define MTU_MC19_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E0u)

/** \brief 13E2, Read Data and Bit Flip Register 65 */
#define MTU_MC19_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E2u)

/** \brief 13E4, Read Data and Bit Flip Register 66 */
#define MTU_MC19_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00623E4u)

/** \brief 13EE, Alarm Sources Configuration Register */
#define MTU_MC19_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00623EEu)

