zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 26CE, Read Data and Bit Flip Register 55 */
#define MTU_MC38_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CEu)

/** \brief 26D0, Read Data and Bit Flip Register 56 */
#define MTU_MC38_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D0u)

/** \brief 26D2, Read Data and Bit Flip Register 57 */
#define MTU_MC38_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D2u)

/** \brief 26D4, Read Data and Bit Flip Register 58 */
#define MTU_MC38_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D4u)

/** \brief 26D6, Read Data and Bit Flip Register 59 */
#define MTU_MC38_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D6u)

/** \brief 26D8, Read Data and Bit Flip Register 60 */
#define MTU_MC38_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636D8u)

/** \brief 26DA, Read Data and Bit Flip Register 61 */
#define MTU_MC38_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DAu)

/** \brief 26DC, Read Data and Bit Flip Register 62 */
#define MTU_MC38_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DCu)

/** \brief 26DE, Read Data and Bit Flip Register 63 */
#define MTU_MC38_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636DEu)

/** \brief 26E0, Read Data and Bit Flip Register 64 */
#define MTU_MC38_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E0u)

/** \brief 26E2, Read Data and Bit Flip Register 65 */
#define MTU_MC38_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E2u)

/** \brief 26E4, Read Data and Bit Flip Register 66 */
#define MTU_MC38_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636E4u)

/** \brief 26EE, Alarm Sources Configuration Register */
#define MTU_MC38_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00636EEu)

/** \brief 26F0, SSH Safety Faults Status Register  */
#define MTU_MC38_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00636F0u)

/** \brief 26F2, Error Information Register 0 */
#define MTU_MC38_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F2u)

/** \brief 26F4, Error Information Register 1 */
#define MTU_MC38_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F4u)

/** \brief 26F6, Error Information Register 2 */
#define MTU_MC38_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F6u)

/** \brief 26F8, Error Information Register 3 */
#define MTU_MC38_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636F8u)

/** \brief 26FA, Error Information Register 4 */
#define MTU_MC38_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00636FAu)

/** \brief 2700, Configuration Registers */
#define MTU_MC39_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063700u)

/** \brief 2702, Configuration Register 1 */
#define MTU_MC39_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063702u)

/** \brief 2704, MBIST Control Register */
#define MTU_MC39_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063704u)

/** \brief 2706, Status Register */
#define MTU_MC39_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063706u)

/** \brief 2708, Range Register, single address mode */
#define MTU_MC39_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063708u)

/** \brief 270C, Revision ID Register */
#define MTU_MC39_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006370Cu)

/** \brief 270E, ECC Safety Register */
#define MTU_MC39_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006370Eu)

/** \brief 2710, Memory ECC Detection Register */
#define MTU_MC39_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063710u)

/** \brief 2712, Error Tracking Register 0 */
#define MTU_MC39_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063712u)

/** \brief 2714, Error Tracking Register 1 */
#define MTU_MC39_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063714u)

/** \brief 2716, Error Tracking Register 2 */
#define MTU_MC39_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063716u)

/** \brief 2718, Error Tracking Register 3 */
#define MTU_MC39_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063718u)

/** \brief 271A, Error Tracking Register 4 */
#define MTU_MC39_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006371Au)

/** \brief 2760, Read Data and Bit Flip Register 0 */
#define MTU_MC39_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063760u)

/** \brief 2762, Read Data and Bit Flip Register 1 */
#define MTU_MC39_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063762u)

/** \brief 2764, Read Data and Bit Flip Register 2 */
#define MTU_MC39_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063764u)

/** \brief 2766, Read Data and Bit Flip Register 3 */
#define MTU_MC39_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063766u)

/** \brief 2768, Read Data and Bit Flip Register 4 */
#define MTU_MC39_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063768u)

/** \brief 276A, Read Data and Bit Flip Register 5 */
#define MTU_MC39_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Au)

/** \brief 276C, Read Data and Bit Flip Register 6 */
#define MTU_MC39_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Cu)

/** \brief 276E, Read Data and Bit Flip Register 7 */
#define MTU_MC39_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006376Eu)

/** \brief 2770, Read Data and Bit Flip Register 8 */
#define MTU_MC39_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063770u)

/** \brief 2772, Read Data and Bit Flip Register 9 */
#define MTU_MC39_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063772u)

/** \brief 2774, Read Data and Bit Flip Register 10 */
#define MTU_MC39_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063774u)

/** \brief 2776, Read Data and Bit Flip Register 11 */
#define MTU_MC39_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063776u)

/** \brief 2778, Read Data and Bit Flip Register 12 */
#define MTU_MC39_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063778u)

/** \brief 277A, Read Data and Bit Flip Register 13 */
#define MTU_MC39_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Au)

