zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 2898, Read Data and Bit Flip Register 28 */
#define MTU_MC40_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063898u)

/** \brief 289A, Read Data and Bit Flip Register 29 */
#define MTU_MC40_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Au)

/** \brief 289C, Read Data and Bit Flip Register 30 */
#define MTU_MC40_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Cu)

/** \brief 289E, Read Data and Bit Flip Register 31 */
#define MTU_MC40_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006389Eu)

/** \brief 28A0, Read Data and Bit Flip Register 32 */
#define MTU_MC40_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A0u)

/** \brief 28A2, Read Data and Bit Flip Register 33 */
#define MTU_MC40_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A2u)

/** \brief 28A4, Read Data and Bit Flip Register 34 */
#define MTU_MC40_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A4u)

/** \brief 28A6, Read Data and Bit Flip Register 35 */
#define MTU_MC40_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A6u)

/** \brief 28A8, Read Data and Bit Flip Register 36 */
#define MTU_MC40_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638A8u)

/** \brief 28AA, Read Data and Bit Flip Register 37 */
#define MTU_MC40_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638AAu)

/** \brief 28AC, Read Data and Bit Flip Register 38 */
#define MTU_MC40_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638ACu)

/** \brief 28AE, Read Data and Bit Flip Register 39 */
#define MTU_MC40_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638AEu)

/** \brief 28B0, Read Data and Bit Flip Register 40 */
#define MTU_MC40_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B0u)

/** \brief 28B2, Read Data and Bit Flip Register 41 */
#define MTU_MC40_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B2u)

/** \brief 28B4, Read Data and Bit Flip Register 42 */
#define MTU_MC40_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B4u)

/** \brief 28B6, Read Data and Bit Flip Register 43 */
#define MTU_MC40_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B6u)

/** \brief 28B8, Read Data and Bit Flip Register 44 */
#define MTU_MC40_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638B8u)

/** \brief 28BA, Read Data and Bit Flip Register 45 */
#define MTU_MC40_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BAu)

/** \brief 28BC, Read Data and Bit Flip Register 46 */
#define MTU_MC40_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BCu)

/** \brief 28BE, Read Data and Bit Flip Register 47 */
#define MTU_MC40_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638BEu)

/** \brief 28C0, Read Data and Bit Flip Register 48 */
#define MTU_MC40_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C0u)

/** \brief 28C2, Read Data and Bit Flip Register 49 */
#define MTU_MC40_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C2u)

/** \brief 28C4, Read Data and Bit Flip Register 50 */
#define MTU_MC40_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C4u)

/** \brief 28C6, Read Data and Bit Flip Register 51 */
#define MTU_MC40_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C6u)

/** \brief 28C8, Read Data and Bit Flip Register 52 */
#define MTU_MC40_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638C8u)

/** \brief 28CA, Read Data and Bit Flip Register 53 */
#define MTU_MC40_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CAu)

/** \brief 28CC, Read Data and Bit Flip Register 54 */
#define MTU_MC40_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CCu)

/** \brief 28CE, Read Data and Bit Flip Register 55 */
#define MTU_MC40_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638CEu)

/** \brief 28D0, Read Data and Bit Flip Register 56 */
#define MTU_MC40_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D0u)

/** \brief 28D2, Read Data and Bit Flip Register 57 */
#define MTU_MC40_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D2u)

/** \brief 28D4, Read Data and Bit Flip Register 58 */
#define MTU_MC40_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D4u)

/** \brief 28D6, Read Data and Bit Flip Register 59 */
#define MTU_MC40_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D6u)

/** \brief 28D8, Read Data and Bit Flip Register 60 */
#define MTU_MC40_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638D8u)

/** \brief 28DA, Read Data and Bit Flip Register 61 */
#define MTU_MC40_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DAu)

/** \brief 28DC, Read Data and Bit Flip Register 62 */
#define MTU_MC40_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DCu)

/** \brief 28DE, Read Data and Bit Flip Register 63 */
#define MTU_MC40_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638DEu)

/** \brief 28E0, Read Data and Bit Flip Register 64 */
#define MTU_MC40_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E0u)

/** \brief 28E2, Read Data and Bit Flip Register 65 */
#define MTU_MC40_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E2u)

/** \brief 28E4, Read Data and Bit Flip Register 66 */
#define MTU_MC40_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00638E4u)

/** \brief 28EE, Alarm Sources Configuration Register */
#define MTU_MC40_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00638EEu)

/** \brief 28F0, SSH Safety Faults Status Register  */
#define MTU_MC40_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00638F0u)

/** \brief 28F2, Error Information Register 0 */
#define MTU_MC40_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F2u)

/** \brief 28F4, Error Information Register 1 */
#define MTU_MC40_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F4u)

/** \brief 28F6, Error Information Register 2 */
#define MTU_MC40_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F6u)

/** \brief 28F8, Error Information Register 3 */
#define MTU_MC40_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638F8u)

/** \brief 28FA, Error Information Register 4 */
#define MTU_MC40_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00638FAu)

/** \brief 2900, Configuration Registers */
#define MTU_MC41_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063900u)

/** \brief 2902, Configuration Register 1 */
#define MTU_MC41_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063902u)

