zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 2D70, Read Data and Bit Flip Register 8 */
#define MTU_MC45_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D70u)

/** \brief 2D72, Read Data and Bit Flip Register 9 */
#define MTU_MC45_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D72u)

/** \brief 2D74, Read Data and Bit Flip Register 10 */
#define MTU_MC45_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D74u)

/** \brief 2D76, Read Data and Bit Flip Register 11 */
#define MTU_MC45_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D76u)

/** \brief 2D78, Read Data and Bit Flip Register 12 */
#define MTU_MC45_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D78u)

/** \brief 2D7A, Read Data and Bit Flip Register 13 */
#define MTU_MC45_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Au)

/** \brief 2D7C, Read Data and Bit Flip Register 14 */
#define MTU_MC45_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Cu)

/** \brief 2D7E, Read Data and Bit Flip Register 15 */
#define MTU_MC45_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D7Eu)

/** \brief 2D80, Read Data and Bit Flip Register 16 */
#define MTU_MC45_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D80u)

/** \brief 2D82, Read Data and Bit Flip Register 17 */
#define MTU_MC45_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D82u)

/** \brief 2D84, Read Data and Bit Flip Register 18 */
#define MTU_MC45_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D84u)

/** \brief 2D86, Read Data and Bit Flip Register 19 */
#define MTU_MC45_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D86u)

/** \brief 2D88, Read Data and Bit Flip Register 20 */
#define MTU_MC45_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D88u)

/** \brief 2D8A, Read Data and Bit Flip Register 21 */
#define MTU_MC45_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Au)

/** \brief 2D8C, Read Data and Bit Flip Register 22 */
#define MTU_MC45_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Cu)

/** \brief 2D8E, Read Data and Bit Flip Register 23 */
#define MTU_MC45_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D8Eu)

/** \brief 2D90, Read Data and Bit Flip Register 24 */
#define MTU_MC45_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D90u)

/** \brief 2D92, Read Data and Bit Flip Register 25 */
#define MTU_MC45_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D92u)

/** \brief 2D94, Read Data and Bit Flip Register 26 */
#define MTU_MC45_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D94u)

/** \brief 2D96, Read Data and Bit Flip Register 27 */
#define MTU_MC45_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D96u)

/** \brief 2D98, Read Data and Bit Flip Register 28 */
#define MTU_MC45_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D98u)

/** \brief 2D9A, Read Data and Bit Flip Register 29 */
#define MTU_MC45_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Au)

/** \brief 2D9C, Read Data and Bit Flip Register 30 */
#define MTU_MC45_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Cu)

/** \brief 2D9E, Read Data and Bit Flip Register 31 */
#define MTU_MC45_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D9Eu)

/** \brief 2DA0, Read Data and Bit Flip Register 32 */
#define MTU_MC45_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA0u)

/** \brief 2DA2, Read Data and Bit Flip Register 33 */
#define MTU_MC45_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA2u)

/** \brief 2DA4, Read Data and Bit Flip Register 34 */
#define MTU_MC45_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA4u)

/** \brief 2DA6, Read Data and Bit Flip Register 35 */
#define MTU_MC45_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA6u)

/** \brief 2DA8, Read Data and Bit Flip Register 36 */
#define MTU_MC45_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DA8u)

/** \brief 2DAA, Read Data and Bit Flip Register 37 */
#define MTU_MC45_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DAAu)

/** \brief 2DAC, Read Data and Bit Flip Register 38 */
#define MTU_MC45_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DACu)

/** \brief 2DAE, Read Data and Bit Flip Register 39 */
#define MTU_MC45_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DAEu)

/** \brief 2DB0, Read Data and Bit Flip Register 40 */
#define MTU_MC45_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB0u)

/** \brief 2DB2, Read Data and Bit Flip Register 41 */
#define MTU_MC45_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB2u)

/** \brief 2DB4, Read Data and Bit Flip Register 42 */
#define MTU_MC45_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB4u)

/** \brief 2DB6, Read Data and Bit Flip Register 43 */
#define MTU_MC45_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB6u)

/** \brief 2DB8, Read Data and Bit Flip Register 44 */
#define MTU_MC45_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DB8u)

/** \brief 2DBA, Read Data and Bit Flip Register 45 */
#define MTU_MC45_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBAu)

/** \brief 2DBC, Read Data and Bit Flip Register 46 */
#define MTU_MC45_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBCu)

/** \brief 2DBE, Read Data and Bit Flip Register 47 */
#define MTU_MC45_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DBEu)

/** \brief 2DC0, Read Data and Bit Flip Register 48 */
#define MTU_MC45_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC0u)

/** \brief 2DC2, Read Data and Bit Flip Register 49 */
#define MTU_MC45_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC2u)

/** \brief 2DC4, Read Data and Bit Flip Register 50 */
#define MTU_MC45_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC4u)

/** \brief 2DC6, Read Data and Bit Flip Register 51 */
#define MTU_MC45_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC6u)

