zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 30CC, Read Data and Bit Flip Register 54 */
#define MTU_MC48_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CCu)

/** \brief 30CE, Read Data and Bit Flip Register 55 */
#define MTU_MC48_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CEu)

/** \brief 30D0, Read Data and Bit Flip Register 56 */
#define MTU_MC48_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D0u)

/** \brief 30D2, Read Data and Bit Flip Register 57 */
#define MTU_MC48_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D2u)

/** \brief 30D4, Read Data and Bit Flip Register 58 */
#define MTU_MC48_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D4u)

/** \brief 30D6, Read Data and Bit Flip Register 59 */
#define MTU_MC48_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D6u)

/** \brief 30D8, Read Data and Bit Flip Register 60 */
#define MTU_MC48_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640D8u)

/** \brief 30DA, Read Data and Bit Flip Register 61 */
#define MTU_MC48_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DAu)

/** \brief 30DC, Read Data and Bit Flip Register 62 */
#define MTU_MC48_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DCu)

/** \brief 30DE, Read Data and Bit Flip Register 63 */
#define MTU_MC48_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640DEu)

/** \brief 30E0, Read Data and Bit Flip Register 64 */
#define MTU_MC48_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E0u)

/** \brief 30E2, Read Data and Bit Flip Register 65 */
#define MTU_MC48_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E2u)

/** \brief 30E4, Read Data and Bit Flip Register 66 */
#define MTU_MC48_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640E4u)

/** \brief 30EE, Alarm Sources Configuration Register */
#define MTU_MC48_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00640EEu)

/** \brief 30F0, SSH Safety Faults Status Register  */
#define MTU_MC48_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00640F0u)

/** \brief 30F2, Error Information Register 0 */
#define MTU_MC48_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F2u)

/** \brief 30F4, Error Information Register 1 */
#define MTU_MC48_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F4u)

/** \brief 30F6, Error Information Register 2 */
#define MTU_MC48_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F6u)

/** \brief 30F8, Error Information Register 3 */
#define MTU_MC48_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640F8u)

/** \brief 30FA, Error Information Register 4 */
#define MTU_MC48_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00640FAu)

/** \brief 3100, Configuration Registers */
#define MTU_MC49_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064100u)

/** \brief 3102, Configuration Register 1 */
#define MTU_MC49_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064102u)

/** \brief 3104, MBIST Control Register */
#define MTU_MC49_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064104u)

/** \brief 3106, Status Register */
#define MTU_MC49_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064106u)

/** \brief 3108, Range Register, single address mode */
#define MTU_MC49_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064108u)

/** \brief 310C, Revision ID Register */
#define MTU_MC49_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006410Cu)

/** \brief 310E, ECC Safety Register */
#define MTU_MC49_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006410Eu)

/** \brief 3110, Memory ECC Detection Register */
#define MTU_MC49_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064110u)

/** \brief 3112, Error Tracking Register 0 */
#define MTU_MC49_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064112u)

/** \brief 3114, Error Tracking Register 1 */
#define MTU_MC49_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064114u)

/** \brief 3116, Error Tracking Register 2 */
#define MTU_MC49_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064116u)

/** \brief 3118, Error Tracking Register 3 */
#define MTU_MC49_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064118u)

/** \brief 311A, Error Tracking Register 4 */
#define MTU_MC49_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006411Au)

/** \brief 3160, Read Data and Bit Flip Register 0 */
#define MTU_MC49_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064160u)

/** \brief 3162, Read Data and Bit Flip Register 1 */
#define MTU_MC49_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064162u)

/** \brief 3164, Read Data and Bit Flip Register 2 */
#define MTU_MC49_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064164u)

/** \brief 3166, Read Data and Bit Flip Register 3 */
#define MTU_MC49_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064166u)

/** \brief 3168, Read Data and Bit Flip Register 4 */
#define MTU_MC49_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064168u)

/** \brief 316A, Read Data and Bit Flip Register 5 */
#define MTU_MC49_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Au)

/** \brief 316C, Read Data and Bit Flip Register 6 */
#define MTU_MC49_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Cu)

/** \brief 316E, Read Data and Bit Flip Register 7 */
#define MTU_MC49_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006416Eu)

/** \brief 3170, Read Data and Bit Flip Register 8 */
#define MTU_MC49_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064170u)

/** \brief 3172, Read Data and Bit Flip Register 9 */
#define MTU_MC49_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064172u)

