zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 3D78, Read Data and Bit Flip Register 12 */
#define MTU_MC61_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D78u)

/** \brief 3D7A, Read Data and Bit Flip Register 13 */
#define MTU_MC61_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Au)

/** \brief 3D7C, Read Data and Bit Flip Register 14 */
#define MTU_MC61_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Cu)

/** \brief 3D7E, Read Data and Bit Flip Register 15 */
#define MTU_MC61_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D7Eu)

/** \brief 3D80, Read Data and Bit Flip Register 16 */
#define MTU_MC61_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D80u)

/** \brief 3D82, Read Data and Bit Flip Register 17 */
#define MTU_MC61_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D82u)

/** \brief 3D84, Read Data and Bit Flip Register 18 */
#define MTU_MC61_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D84u)

/** \brief 3D86, Read Data and Bit Flip Register 19 */
#define MTU_MC61_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D86u)

/** \brief 3D88, Read Data and Bit Flip Register 20 */
#define MTU_MC61_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D88u)

/** \brief 3D8A, Read Data and Bit Flip Register 21 */
#define MTU_MC61_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Au)

/** \brief 3D8C, Read Data and Bit Flip Register 22 */
#define MTU_MC61_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Cu)

/** \brief 3D8E, Read Data and Bit Flip Register 23 */
#define MTU_MC61_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D8Eu)

/** \brief 3D90, Read Data and Bit Flip Register 24 */
#define MTU_MC61_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D90u)

/** \brief 3D92, Read Data and Bit Flip Register 25 */
#define MTU_MC61_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D92u)

/** \brief 3D94, Read Data and Bit Flip Register 26 */
#define MTU_MC61_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D94u)

/** \brief 3D96, Read Data and Bit Flip Register 27 */
#define MTU_MC61_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D96u)

/** \brief 3D98, Read Data and Bit Flip Register 28 */
#define MTU_MC61_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D98u)

/** \brief 3D9A, Read Data and Bit Flip Register 29 */
#define MTU_MC61_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Au)

/** \brief 3D9C, Read Data and Bit Flip Register 30 */
#define MTU_MC61_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Cu)

/** \brief 3D9E, Read Data and Bit Flip Register 31 */
#define MTU_MC61_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D9Eu)

/** \brief 3DA0, Read Data and Bit Flip Register 32 */
#define MTU_MC61_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA0u)

/** \brief 3DA2, Read Data and Bit Flip Register 33 */
#define MTU_MC61_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA2u)

/** \brief 3DA4, Read Data and Bit Flip Register 34 */
#define MTU_MC61_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA4u)

/** \brief 3DA6, Read Data and Bit Flip Register 35 */
#define MTU_MC61_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA6u)

/** \brief 3DA8, Read Data and Bit Flip Register 36 */
#define MTU_MC61_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DA8u)

/** \brief 3DAA, Read Data and Bit Flip Register 37 */
#define MTU_MC61_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DAAu)

/** \brief 3DAC, Read Data and Bit Flip Register 38 */
#define MTU_MC61_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DACu)

/** \brief 3DAE, Read Data and Bit Flip Register 39 */
#define MTU_MC61_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DAEu)

/** \brief 3DB0, Read Data and Bit Flip Register 40 */
#define MTU_MC61_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB0u)

/** \brief 3DB2, Read Data and Bit Flip Register 41 */
#define MTU_MC61_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB2u)

/** \brief 3DB4, Read Data and Bit Flip Register 42 */
#define MTU_MC61_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB4u)

/** \brief 3DB6, Read Data and Bit Flip Register 43 */
#define MTU_MC61_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB6u)

/** \brief 3DB8, Read Data and Bit Flip Register 44 */
#define MTU_MC61_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DB8u)

/** \brief 3DBA, Read Data and Bit Flip Register 45 */
#define MTU_MC61_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBAu)

/** \brief 3DBC, Read Data and Bit Flip Register 46 */
#define MTU_MC61_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBCu)

/** \brief 3DBE, Read Data and Bit Flip Register 47 */
#define MTU_MC61_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DBEu)

/** \brief 3DC0, Read Data and Bit Flip Register 48 */
#define MTU_MC61_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC0u)

/** \brief 3DC2, Read Data and Bit Flip Register 49 */
#define MTU_MC61_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC2u)

/** \brief 3DC4, Read Data and Bit Flip Register 50 */
#define MTU_MC61_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC4u)

/** \brief 3DC6, Read Data and Bit Flip Register 51 */
#define MTU_MC61_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC6u)

/** \brief 3DC8, Read Data and Bit Flip Register 52 */
#define MTU_MC61_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DC8u)

/** \brief 3DCA, Read Data and Bit Flip Register 53 */
#define MTU_MC61_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCAu)

/** \brief 3DCC, Read Data and Bit Flip Register 54 */
#define MTU_MC61_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064DCCu)

