zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 3E7C, Read Data and Bit Flip Register 14 */
#define MTU_MC62_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Cu)

/** \brief 3E7E, Read Data and Bit Flip Register 15 */
#define MTU_MC62_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E7Eu)

/** \brief 3E80, Read Data and Bit Flip Register 16 */
#define MTU_MC62_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E80u)

/** \brief 3E82, Read Data and Bit Flip Register 17 */
#define MTU_MC62_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E82u)

/** \brief 3E84, Read Data and Bit Flip Register 18 */
#define MTU_MC62_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E84u)

/** \brief 3E86, Read Data and Bit Flip Register 19 */
#define MTU_MC62_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E86u)

/** \brief 3E88, Read Data and Bit Flip Register 20 */
#define MTU_MC62_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E88u)

/** \brief 3E8A, Read Data and Bit Flip Register 21 */
#define MTU_MC62_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Au)

/** \brief 3E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC62_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Cu)

/** \brief 3E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC62_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E8Eu)

/** \brief 3E90, Read Data and Bit Flip Register 24 */
#define MTU_MC62_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E90u)

/** \brief 3E92, Read Data and Bit Flip Register 25 */
#define MTU_MC62_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E92u)

/** \brief 3E94, Read Data and Bit Flip Register 26 */
#define MTU_MC62_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E94u)

/** \brief 3E96, Read Data and Bit Flip Register 27 */
#define MTU_MC62_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E96u)

/** \brief 3E98, Read Data and Bit Flip Register 28 */
#define MTU_MC62_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E98u)

/** \brief 3E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC62_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Au)

/** \brief 3E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC62_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Cu)

/** \brief 3E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC62_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064E9Eu)

/** \brief 3EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC62_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA0u)

/** \brief 3EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC62_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA2u)

/** \brief 3EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC62_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA4u)

/** \brief 3EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC62_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA6u)

/** \brief 3EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC62_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EA8u)

/** \brief 3EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC62_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EAAu)

/** \brief 3EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC62_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EACu)

/** \brief 3EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC62_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EAEu)

/** \brief 3EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC62_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB0u)

/** \brief 3EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC62_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB2u)

/** \brief 3EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC62_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB4u)

/** \brief 3EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC62_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB6u)

/** \brief 3EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC62_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EB8u)

/** \brief 3EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC62_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBAu)

/** \brief 3EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC62_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBCu)

/** \brief 3EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC62_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EBEu)

/** \brief 3EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC62_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC0u)

/** \brief 3EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC62_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC2u)

/** \brief 3EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC62_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC4u)

/** \brief 3EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC62_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC6u)

/** \brief 3EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC62_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EC8u)

/** \brief 3ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC62_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECAu)

/** \brief 3ECC, Read Data and Bit Flip Register 54 */
#define MTU_MC62_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECCu)

/** \brief 3ECE, Read Data and Bit Flip Register 55 */
#define MTU_MC62_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ECEu)

/** \brief 3ED0, Read Data and Bit Flip Register 56 */
#define MTU_MC62_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED0u)

/** \brief 3ED2, Read Data and Bit Flip Register 57 */
#define MTU_MC62_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED2u)

/** \brief 3ED4, Read Data and Bit Flip Register 58 */
#define MTU_MC62_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED4u)

/** \brief 3ED6, Read Data and Bit Flip Register 59 */
#define MTU_MC62_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED6u)

/** \brief 3ED8, Read Data and Bit Flip Register 60 */
#define MTU_MC62_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ED8u)

/** \brief 3EDA, Read Data and Bit Flip Register 61 */
#define MTU_MC62_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDAu)

/** \brief 3EDC, Read Data and Bit Flip Register 62 */
#define MTU_MC62_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDCu)

/** \brief 3EDE, Read Data and Bit Flip Register 63 */
#define MTU_MC62_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EDEu)

/** \brief 3EE0, Read Data and Bit Flip Register 64 */
#define MTU_MC62_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE0u)

/** \brief 3EE2, Read Data and Bit Flip Register 65 */
#define MTU_MC62_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE2u)

/** \brief 3EE4, Read Data and Bit Flip Register 66 */
#define MTU_MC62_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064EE4u)

/** \brief 3EEE, Alarm Sources Configuration Register */
#define MTU_MC62_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064EEEu)

/** \brief 3EF0, SSH Safety Faults Status Register  */
#define MTU_MC62_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064EF0u)

/** \brief 3EF2, Error Information Register 0 */
#define MTU_MC62_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF2u)

/** \brief 3EF4, Error Information Register 1 */
#define MTU_MC62_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF4u)

/** \brief 3EF6, Error Information Register 2 */
#define MTU_MC62_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF6u)

/** \brief 3EF8, Error Information Register 3 */
#define MTU_MC62_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EF8u)

/** \brief 3EFA, Error Information Register 4 */
#define MTU_MC62_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064EFAu)

/** \brief 3F00, Configuration Registers */
#define MTU_MC63_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064F00u)

/** \brief 3F02, Configuration Register 1 */
#define MTU_MC63_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064F02u)

/** \brief 3F04, MBIST Control Register */
#define MTU_MC63_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064F04u)

/** \brief 3F06, Status Register */
#define MTU_MC63_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064F06u)

/** \brief 3F08, Range Register, single address mode */
#define MTU_MC63_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064F08u)

/** \brief 3F0C, Revision ID Register */
#define MTU_MC63_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064F0Cu)

/** \brief 3F0E, ECC Safety Register */
#define MTU_MC63_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064F0Eu)

/** \brief 3F10, Memory ECC Detection Register */
#define MTU_MC63_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064F10u)

/** \brief 3F12, Error Tracking Register 0 */
#define MTU_MC63_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F12u)

