zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 4174, Read Data and Bit Flip Register 10 */
#define MTU_MC65_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065174u)

/** \brief 4176, Read Data and Bit Flip Register 11 */
#define MTU_MC65_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065176u)

/** \brief 4178, Read Data and Bit Flip Register 12 */
#define MTU_MC65_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065178u)

/** \brief 417A, Read Data and Bit Flip Register 13 */
#define MTU_MC65_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Au)

/** \brief 417C, Read Data and Bit Flip Register 14 */
#define MTU_MC65_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Cu)

/** \brief 417E, Read Data and Bit Flip Register 15 */
#define MTU_MC65_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006517Eu)

/** \brief 4180, Read Data and Bit Flip Register 16 */
#define MTU_MC65_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065180u)

/** \brief 4182, Read Data and Bit Flip Register 17 */
#define MTU_MC65_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065182u)

/** \brief 4184, Read Data and Bit Flip Register 18 */
#define MTU_MC65_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065184u)

/** \brief 4186, Read Data and Bit Flip Register 19 */
#define MTU_MC65_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065186u)

/** \brief 4188, Read Data and Bit Flip Register 20 */
#define MTU_MC65_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065188u)

/** \brief 418A, Read Data and Bit Flip Register 21 */
#define MTU_MC65_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Au)

/** \brief 418C, Read Data and Bit Flip Register 22 */
#define MTU_MC65_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Cu)

/** \brief 418E, Read Data and Bit Flip Register 23 */
#define MTU_MC65_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006518Eu)

/** \brief 4190, Read Data and Bit Flip Register 24 */
#define MTU_MC65_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065190u)

/** \brief 4192, Read Data and Bit Flip Register 25 */
#define MTU_MC65_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065192u)

/** \brief 4194, Read Data and Bit Flip Register 26 */
#define MTU_MC65_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065194u)

/** \brief 4196, Read Data and Bit Flip Register 27 */
#define MTU_MC65_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065196u)

/** \brief 4198, Read Data and Bit Flip Register 28 */
#define MTU_MC65_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065198u)

/** \brief 419A, Read Data and Bit Flip Register 29 */
#define MTU_MC65_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Au)

/** \brief 419C, Read Data and Bit Flip Register 30 */
#define MTU_MC65_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Cu)

/** \brief 419E, Read Data and Bit Flip Register 31 */
#define MTU_MC65_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006519Eu)

/** \brief 41A0, Read Data and Bit Flip Register 32 */
#define MTU_MC65_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A0u)

/** \brief 41A2, Read Data and Bit Flip Register 33 */
#define MTU_MC65_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A2u)

/** \brief 41A4, Read Data and Bit Flip Register 34 */
#define MTU_MC65_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A4u)

/** \brief 41A6, Read Data and Bit Flip Register 35 */
#define MTU_MC65_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A6u)

/** \brief 41A8, Read Data and Bit Flip Register 36 */
#define MTU_MC65_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651A8u)

/** \brief 41AA, Read Data and Bit Flip Register 37 */
#define MTU_MC65_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651AAu)

/** \brief 41AC, Read Data and Bit Flip Register 38 */
#define MTU_MC65_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651ACu)

/** \brief 41AE, Read Data and Bit Flip Register 39 */
#define MTU_MC65_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651AEu)

/** \brief 41B0, Read Data and Bit Flip Register 40 */
#define MTU_MC65_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B0u)

/** \brief 41B2, Read Data and Bit Flip Register 41 */
#define MTU_MC65_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B2u)

/** \brief 41B4, Read Data and Bit Flip Register 42 */
#define MTU_MC65_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B4u)

/** \brief 41B6, Read Data and Bit Flip Register 43 */
#define MTU_MC65_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B6u)

/** \brief 41B8, Read Data and Bit Flip Register 44 */
#define MTU_MC65_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651B8u)

/** \brief 41BA, Read Data and Bit Flip Register 45 */
#define MTU_MC65_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BAu)

/** \brief 41BC, Read Data and Bit Flip Register 46 */
#define MTU_MC65_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BCu)

/** \brief 41BE, Read Data and Bit Flip Register 47 */
#define MTU_MC65_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651BEu)

/** \brief 41C0, Read Data and Bit Flip Register 48 */
#define MTU_MC65_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C0u)

/** \brief 41C2, Read Data and Bit Flip Register 49 */
#define MTU_MC65_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C2u)

/** \brief 41C4, Read Data and Bit Flip Register 50 */
#define MTU_MC65_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C4u)

/** \brief 41C6, Read Data and Bit Flip Register 51 */
#define MTU_MC65_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00651C6u)

