zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMtu_reg.h
/** \brief 5B0C, Revision ID Register */
#define MTU_MC91_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066B0Cu)

/** \brief 5B0E, ECC Safety Register */
#define MTU_MC91_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066B0Eu)

/** \brief 5B10, Memory ECC Detection Register */
#define MTU_MC91_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066B10u)

/** \brief 5B12, Error Tracking Register 0 */
#define MTU_MC91_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066B12u)

/** \brief 5B14, Error Tracking Register 1 */
#define MTU_MC91_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066B14u)

/** \brief 5B16, Error Tracking Register 2 */
#define MTU_MC91_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066B16u)

/** \brief 5B18, Error Tracking Register 3 */
#define MTU_MC91_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066B18u)

/** \brief 5B1A, Error Tracking Register 4 */
#define MTU_MC91_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066B1Au)

/** \brief 5B60, Read Data and Bit Flip Register 0 */
#define MTU_MC91_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B60u)

/** \brief 5B62, Read Data and Bit Flip Register 1 */
#define MTU_MC91_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B62u)

/** \brief 5B64, Read Data and Bit Flip Register 2 */
#define MTU_MC91_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B64u)

/** \brief 5B66, Read Data and Bit Flip Register 3 */
#define MTU_MC91_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B66u)

/** \brief 5B68, Read Data and Bit Flip Register 4 */
#define MTU_MC91_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B68u)

/** \brief 5B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC91_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B6Au)

/** \brief 5B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC91_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B6Cu)

/** \brief 5B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC91_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B6Eu)

/** \brief 5B70, Read Data and Bit Flip Register 8 */
#define MTU_MC91_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B70u)

/** \brief 5B72, Read Data and Bit Flip Register 9 */
#define MTU_MC91_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B72u)

/** \brief 5B74, Read Data and Bit Flip Register 10 */
#define MTU_MC91_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B74u)

/** \brief 5B76, Read Data and Bit Flip Register 11 */
#define MTU_MC91_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B76u)

/** \brief 5B78, Read Data and Bit Flip Register 12 */
#define MTU_MC91_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B78u)

/** \brief 5B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC91_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B7Au)

/** \brief 5B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC91_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B7Cu)

/** \brief 5B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC91_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B7Eu)

/** \brief 5B80, Read Data and Bit Flip Register 16 */
#define MTU_MC91_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B80u)

/** \brief 5B82, Read Data and Bit Flip Register 17 */
#define MTU_MC91_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B82u)

/** \brief 5B84, Read Data and Bit Flip Register 18 */
#define MTU_MC91_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B84u)

/** \brief 5B86, Read Data and Bit Flip Register 19 */
#define MTU_MC91_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B86u)

/** \brief 5B88, Read Data and Bit Flip Register 20 */
#define MTU_MC91_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B88u)

/** \brief 5B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC91_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B8Au)

/** \brief 5B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC91_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B8Cu)

/** \brief 5B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC91_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B8Eu)

/** \brief 5B90, Read Data and Bit Flip Register 24 */
#define MTU_MC91_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B90u)

/** \brief 5B92, Read Data and Bit Flip Register 25 */
#define MTU_MC91_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B92u)

/** \brief 5B94, Read Data and Bit Flip Register 26 */
#define MTU_MC91_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B94u)

/** \brief 5B96, Read Data and Bit Flip Register 27 */
#define MTU_MC91_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B96u)

/** \brief 5B98, Read Data and Bit Flip Register 28 */
#define MTU_MC91_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B98u)

/** \brief 5B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC91_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B9Au)

/** \brief 5B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC91_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B9Cu)

/** \brief 5B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC91_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066B9Eu)

/** \brief 5BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC91_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA0u)

/** \brief 5BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC91_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA2u)

/** \brief 5BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC91_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA4u)

/** \brief 5BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC91_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA6u)

/** \brief 5BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC91_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BA8u)

/** \brief 5BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC91_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BAAu)

/** \brief 5BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC91_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BACu)

/** \brief 5BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC91_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BAEu)

/** \brief 5BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC91_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB0u)

/** \brief 5BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC91_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB2u)

/** \brief 5BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC91_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB4u)

/** \brief 5BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC91_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB6u)

/** \brief 5BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC91_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BB8u)

/** \brief 5BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC91_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBAu)

/** \brief 5BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC91_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBCu)

/** \brief 5BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC91_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BBEu)

/** \brief 5BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC91_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC0u)

/** \brief 5BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC91_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC2u)

/** \brief 5BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC91_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC4u)

/** \brief 5BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC91_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC6u)

/** \brief 5BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC91_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BC8u)

/** \brief 5BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC91_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066BCAu)

